---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyStructFootingUseCapTop
source: html/6ca155b6-e80d-a615-d70a-f21953675eb9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyStructFootingUseCapTop Property

"Cap"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyStructFootingUseCapTop { get; }
```